管理方功能
水果資料表
新增資料
查詢資料
刪除資料
修改資料
可以查詢某一水果在「公司內現有數量」與其「現有價值小計」。
可以查詢公司內所有現有數量之水果「現有價值小計」之總和。

會員資料表介面
可以統計會員人數、會員平均年齡等資料。
新增資料：新增會員資料。
查詢資料：至少須能以「會員身分證字號」或「會員姓名」查詢會員資料。
刪除資料：刪去已經不需要之資料（係將資料移入「靜止會員資料表」中，而不是真的刪除）。
修改資料：當會員資料與事實不符時，例如，Email或電話變更，用以修改。

3.	靜止會員資料表：須能新增資料、查詢資料、移轉資料、修改資料及列印資料，其中
新增資料：新增會員資料。
查詢資料：至少須能以「會員身分證字號」或「會員姓名」查詢會員資料。
刪除資料：刪去已經不需要之資料（係將資料移入「靜止會員資料表」中，而不是真的刪除）。
修改資料：當會員資料與事實不符時，例如，Email或電話變更，用以修改。
可以統計會員人數、會員平均年齡等資料

4.	供應商資料表介面：
(1)	須符合「供應商資料表」系統功能之需求。
(2)	可以查詢一共有多少供應商供應水果給東海水果公司。
(3)	可以查詢有幾家供應商的Email是相同的，或負責人是同一人。

5.	水果交易資料表介面：
(1)	須符合「水果交易資料表」系統功能之需求。
(2)	可以查詢某一位會員所購買某一供應商所供應水果之總金額(分別計算已交水果給會員與未交水果給會員兩部分)。
(3)	可以查詢全體會員購買某一供應商所供應水果之總金額(合併計算已交水果給會員與未交水果給會員兩部分)。
(4)	可以查詢某一位會員購買總金額(不分供應商，也不分是否已交貨給會員)。
(5)	可以查詢全體會員購買總金額(不分供應商，也不分是否已交貨給會員)。
(6)	可以排序各會員購買總金額(分開已交貨與未交貨兩部分)，並可以列印其姓名、Email、電話及兩項購買(已交貨與未交貨)各自總金額。
(7)	可以查詢哪一些水果訂單尚未出貨給會員，並列印其會員姓名、Email、電話及購買數量與總金額。



<li><a href="increase_fruit.php">水果新增</a></li>
<li><a href="search_fruit.php">水果查詢</a></li>
<li><a href="delete_frui.php">水果查詢已刪除資料</a></li>
<li><a href="fix_fruit.php">水果修改</a></li>